Revit 2027 API
GuidEnum Constructor
 Creates an Guid-based enum instance with the supplied name and GUID. GUID-based enum instance can be compared by this guid value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GuidEnum(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
GuidEnum(
	Guid guid
)
new :
        guid : Guid -> GuidEnum
Parameters
guid Guid
 The GUID of this GUID-based enum.
See Also
Reference
GuidEnum Class
Autodesk.Revit.DB Namespace